<template>
    <header class="header">
        <Goback :route="'/user'" />
        <div class="useragement_header">
            <h1>使用协议</h1>
        </div>
    </header>

    <div class="content">
        <h1>使用协议</h1>
        <p>
            在此特别提醒您（用户）在注册成为用户之前，
            请认真阅读本《使用协议》（以下简称“协议”），确
            保您充分理解本协议中各条款。请您审慎阅读并选择
            接受或不接受本协议。除非您接受本协议所有条款，
            否则您无权注册、登录或使用本协议所涉服务。您的
            注册、登录、使用等行为将视为对本协议的接受，并
            同意接受本协议各项条款的约束。本协议约定AA巴士
            与用户之间关于“AA巴士"软件服务（以下简称“服
            务”）的权利义务。“用户”是指注册、登录、使用本服
            务的个人。本协议可由AA巴士随时更新，更新后的协
            议条款一旦公布即代替原来的协议条款，恕不再另行
            通知，用户可在本Aviewview中查阅最新版协议条
            款。在修改协议条款后，如果用户不接受修改后的条
            款，请立即停止使用AA巴士提供的服务，用户继续使
            用AA巴士提供的服务将被视为接受修改后的协议。
        </p>

        <h2>一、账号注册</h2>
        <p>1、用户在使用本服务前需要注册一个“AA巴士”
            账号。“AA巴士"账号应当使用手机号码绑定注册，请
            用户使用尚未与“AA巴士”账号绑定的手机号码，以及
            未被AA巴士根据本协议封禁的手机号码注册“AA巴士”
            账号。AA巴士可以根据用户需求或产品需要对账号注
            册和绑定的方式进行变更，而无须事先通知用户。.</p>
        <p>2、“AA巴士"系基于同城服务的Aviewview产品，
            用户注册时应当授权AA巴士公开及使用其个人信息方

            式。AA巴士需要这些信息与用户联系并确认身份。AA巴士
            承诺不向任何无关第三方提供、出售、出租、分享或交易
            用户的个人信息，除非事先得到用户的许可，或该信
            息用于AA巴士的相关服务。</p>

        <p>
            3、用户同意AA巴士可在以下事项中使用用户的个人信息：
            (1) 向用户提供服务，如在用户注册、找回密码、
            使用AA巴士服务等情况下，向用户发出电子邮件或
            信息通讯等，或者向用户及时发送重要信息，如服务
        </p>

        <h2>二、用户发布内容规范</h2>
        <p>
            本条所述内容是指用户使用AA巴士的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、 用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
         
        <p>
            2、用户不得利用 AA巴士 账号或本服务制
            作、上载、复制、发布、 传播如下法律、法规和政策禁止的内容：
        </p>
        <p>
            （1）反对宪法所确定的基本原则的；
        </p>
        <p>
            （2）危害国家安全，泄露国家秘密，颠覆国家
            政权，破坏国家统一的；
        </p>
        <p>
            （3）损害国家荣誉和利益的；
        </p>
        <p>
            （4）损害国家荣誉和利益的；
        </p>
        <p>
            （5）动民族优恨、民族政视，破坏民族团结的；
        </p>
        <p>
            （6）破坏国家宗教政策，宣扬邪教和封建迷信
            的；
        </p>
        <p>
            （7）散布谣言，乱社会秩序，破坏社会稳定
            的；
        </p>
        <p>
            （8）散布浮、色情、赌博、暴力、区杀、
            布或者教犯罪的：
        </p>
        <p>
            （9）含有法律、行政法规禁止的其他内容的信
            息。
        </p>
        </p>




        <h2>三、使用规则</h2>
        <p>
            1、用户在本服务中或通过本服务所传送、发
            布的任何内容并不反映或代表，也不得被视为反映
            或代表AA巴士的观点、立场或政策，AA巴士对此
            不承担任何责任。
        </p>
        <p>
            2、用户不得利用“AA巴士”账号或本服务进
            行如下行为：
            (1)提交、发布虚假信息，或盗用他人头像或
            资料，冒充、利用他人名义的；
            (2)强制、诱导其他用户关注、点击链接页面
            或分享信息的；
            (3)虚构事实、隐瞒真相以误导、欺骗他人
            的
            (4)利用技术手段批量建立虚假账号的；
            (5)利用“AA巴士”账号或本服务从事任何违
            法犯罪活动的；
            (6)制作、发布与以上行为相关的方法、工
            具，或对此类方法、工具进行运营或传播，无论这
            些行为是否为商业目的；
            (7)其他违反法律法规规定、侵犯其他用户合
            法权益、干扰AA巴士正常运营或AA巴士未明示授
            权的行为。
        </p>

        <p>
            3、用户须对利用AA巴士账号或本服务传送信
            息的真实性、合法性、无害性、准确性、有效性等
            全权负责，与用户所传播的信息相关的任何法律责
            任由用户自行承担，与AA巴士无关。如因此给AA

            巴士或任何第三方造成损害的，用户应当依法
            承担全部责任，并保证AA巴士免受损害。如果AA
            巴士发现或收到他人举报或投诉用户违反本协议条
            款，AA巴士有权不经通知随时对相关内容，
            包括用户资料及账号进行审查、删除，并视情
            对违规账号处以包括但不限于警告、账号封禁、设备封禁
            等处罚，且通知用户处理结果。
            用户理解并同意，AA巴士有权依合理判断对

        </p>
        <h2>四、其他</h2>
        <p> 1、AA巴士郑重提醒用户注意本协议中免除AA
            巴士责任和限制用户权利的条款，请用户仔细阅
            读，自主考虑风险。未成年人应在法定监护人的陪
            同下阅读本协议。


        </p>
        <p>
            2、本协议的效力、解释及纠纷的解决，适用
            于中华人民共和国法律。若用户和AA巴士之间发
            生任何纠纷或争议，首先应友好协商解决，协商不
            成的，用户同意将纠纷或争议提交AA巴士住所地
            有管辖权的人民法院管辖。
        </p>

        <p>
            3、本协议的任何条款无论因何种原因无效或
            不具可执行性，其余条款仍有效，对双方具有约束
            力。
        </p>

        <p>
            4、本协议最终解释权归AA巴士归属所有；
        </p>
    </div>

  

</template>

<script setup>
import Goback from '@/components/goback.vue';
import { ref, provide } from 'vue';

const route = ref('/user');
provide('route', route);
</script>

<style scoped>
.header{
    display: flex;
    align-items: center;
    background-color: red;
    color: white;
    font-size: 20px;
    padding: 10px;
}

.useragement_header{
    margin-left: auto;
    margin-right: 10px;
    font-size: 18px;
    color: white;
    cursor: pointer;
    display: flex;
    align-items: center;
    justify-content: center;
    width: 100px;
    height: 40px;
    background-color: #f00;
    border-radius: 10px;
    border: 1px solid #f00;
    box-shadow: 0 0 10px #f00;
}

.content {
  font-size: 16px;
  line-height: 1.6;
  color: #333;
  padding: 20px;
}

h1 {
  font-size: 24px;
  font-weight: bold;
  margin-bottom: 20px;
}

h2 {
  font-size: 20px;
  font-weight: bold;
  margin-top: 30px;
  margin-bottom: 10px;
}

p {
  margin-bottom: 20px;
  border-radius: 0%;
  border: beige;
  box-shadow: #333;
}

.header{
    background-color: red;
    color: whitesmoke;
}
</style>